Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeServiceSizeWarning Property
 The selected fitting(s) cannot successfully change service or change size. You must disconnect the connections on the fitting(s) and try again.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationPartCannotChangeServiceSizeWarning { get; }
Public Shared ReadOnly Property FabricationPartCannotChangeServiceSizeWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationPartCannotChangeServiceSizeWarning {
	FailureDefinitionId^ get ();
}
static member FabricationPartCannotChangeServiceSizeWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace